[
  {
    "header": "Daily Parameter Definition",
    "data": "\nThe climate data in this API is presented as daily aggregations. Multiple weather variables can\nbe retrieved at once. The parameter &daily= accepts the following values as comma separated\nlist:\n\n| Variable | Unit | Description |\n| --- | --- | --- |\n| temperature\\_2m\\_maxtemperature\\_2m\\_mintemperature\\_2m\\_mean | °C (°F) | Maximum, minimum and mean daily air temperature at 2 meters above ground. Additionally, temperature is downscaled using a 90-meter digital elevation model. Climate models are not perfect, and they have inherent uncertainties and biases that can affect the accuracy of their temperature predictions. However, the temperature anomaly over a long period of time is a good indicator the future Earth's climate. The following paper analyses the [robustness of CMIP6 temperature predictions](https://agupubs.onlinelibrary.wiley.com/doi/full/10.1029/2020EF001667). |\n| cloud\\_cover\\_mean | % | Mean cloud cover on a given day. Cloud cover in climate models is generally represented through simplified parameterizations that estimate the cloud amount, height, and thickness based on atmospheric conditions such as temperature, humidity, and wind speed. These parameterizations have been shown to provide reasonable estimates of global cloud cover but they can have significant uncertainties and biases on regional and local scales. Systematic biases have been corrected using the weather reanalysis ERA5. |\n| relative\\_humidity\\_2m\\_maxrelative\\_humidity\\_2m\\_minrelative\\_humidity\\_2m\\_mean | % | Maximum, minimum and mean daily relative humidity at 2 meters above ground. While systematic biases in relative humidity have been removed through bias correction, caution should still be exercised when using relative humidity data as raw data shows larger differences between different climate models. |\n| soil\\_moisture\\_0\\_to\\_10cm\\_mean | m³/m³ | Daily mean soil moisture fraction within 0-10 cm. Soil moisture data is only available by MRI\\_AGCM3\\_2\\_S and EC\\_Earth3P\\_HR. Due to the limited number of climate models that provide soil moisture data, it is not possible to make a general statement about their accuracy. As a result, it may be advisable to conduct your own water balance modeling. |\n| precipitation\\_sum | mm | Sum of daily precipitation (including rain, showers and snowfall). Climate models have been able to capture some of the large-scale patterns of precipitation and associated droughts and extreme precipitation events, particularly over longer time scales. However, there are still uncertainties associated with the representation of precipitation at smaller geographical scales including thunderstorm. Please compare different climate models for drought duration or extreme precipitation events. The following papers analyze [extreme precipitation](https://agupubs.onlinelibrary.wiley.com/doi/full/10.1029/2021EF002196) and [droughts in CMIP6 models](https://agupubs.onlinelibrary.wiley.com/doi/full/10.1029/2021EF002150). |\n| rain\\_sum | mm | Sum of daily liquid rain, excluding snow. |\n| snowfall\\_sum | cm | Sum of daily snowfall. Please note that snowfall data may have larger biases in complex terrain, as it is not adjusted for different terrain elevations. Use this data with caution to estimate how mountainous regions will be effected by reduced snowfall. |\n| wind\\_speed\\_10m\\_meanwind\\_speed\\_10m\\_max | km/h (mph, m/s, knots) | Mean and maximum wind speed 10 meter above ground on a day. Simulations of winds and pressure systems in climate models are greatly influenced by the resolution used to model the terrain. Without bias correction, wind speed can vary significantly between different climate models, particularly in complex terrain. Although, data is bias corrected with ERA5, it might not accurately represent local conditions. |\n| pressure\\_msl\\_mean | hPa | Daily mean air pressure reduced to mean sea level. |\n| shortwave\\_radiation\\_sum | MJ/m² | The sum of solar radiation on a given day in Megajoules. Shortwave radiation predictions are impacted by aerosols and clouds present in the atmosphere. The future composition of gases in the atmosphere is a key area of study in climate modeling. As there are uncertainties associated with aerosols and clouds, it is important to take these into account when using shortwave radiation data. |\n\n### JSON Return Object"
  },
  {
    "header": "JSON Return Object",
    "data": "\nOn success a JSON object will be returned. Please note: the resulting JSON might be multiple\nmega bytes in size.\n\n```\n\n  \"latitude\": 52.52,\n  \"longitude\": 13.419,\n  \"generationtime_ms\": 2.2119,\n  \"timezone\": \"Europe/Berlin\",\n  \"timezone_abbreviation\": \"CEST\",\n  \"daily\": {\n    \"time\": [\"2022-07-01\", \"2022-07-01\", \"2022-07-01\", ...],\n    \"temperature_2m_max\": [13, 12.7, 12.7, 12.5, 12.5, 12.8, ...]\n  },\n  \"daily_units\": {\n    \"temperature_2m\": \"°C\"\n  },\n\n```\n\n| Parameter | Format | Description |\n| --- | --- | --- |\n| latitude, longitude | Floating point | WGS84 of the center of the weather grid-cell which was used to generate this forecast. This coordinate might be a few kilometers away from the requested coordinate. |\n| generationtime\\_ms | Floating point | Generation time of the weather forecast in milliseconds. This is mainly used for performance monitoring and improvements. |\n| utc\\_offset\\_seconds | Integer | Applied timezone offset from the &timezone= parameter. |\n| timezonetimezone\\_abbreviation | String | Timezone identifier (e.g. Europe/Berlin) and abbreviation (e.g. CEST) |\n| daily | Object | For each selected daily weather variable, data will be returned as a floating point array. Additionally a time array will be returned with ISO8601 timestamps. |\n| daily\\_units | Object | For each selected daily weather variable, the unit will be listed here. |\n\n### Errors"
  },
  {
    "header": "Errors",
    "data": "\nIn case an error occurs, for example a URL parameter is not correctly specified, a JSON error\nobject is returned with a HTTP 400 status code.\n\n```\n\n  \"error\": true,\n  \"reason\": \"Cannot initialize WeatherVariable from invalid String value tempeture_2m for key hourly\"\n\n```\n## Citation & Acknowledgement"
  },
  {
    "api-endpoint": "https://climate-api.open-meteo.com/v1/climate"
  }
]
